10/data/attachments/90f25075ea6c9370.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Thomas_feel_Friend_2100_1</nif:username>
            <nif:friendToBeRequested>soap_friends_5641f6b7-83e6-4d8a-a818-da2b14bb7ba5</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>